print('\
\n --------------------------------------------------------------------------')

print('\
\n Тест на знание русского языка.')

print('\
\n --------------------------------------------------------------------------')

b=0
a=input('\
\n 1) Вопрос: Какой прорадитель был русского языка? \
\n Варианты:\
\n а) Старо-восточнославянского языка \
\n б) Римского языка \
\n в) Греческого языка \
\n г) Русского языка \
\n Ответ: ')
if a =="а" or a =="a" or a =="А" or a =="A":
	b=b+1
else:
	b=b+0

print('\
\n Русский язык происходит от старо-восточнославянского языка и как таковой,\
\n имеет общие черты с белорусским и украинским. С принятием христианства был разработан новый алфавит — кириллица.\
\n Русский язык был стандартизирован в течение 18-го века, а затем упрощен после русской революции 1917 года')

a=input('\
\n 2) Вопрос: На каком месте находится русский язык по использованию? \n Варианты: \
\n а) 13-ом \
\n б) 7-ом \
\n в) 3-ем \
\n г) 8-ом \
\n Ответ: ')
if a =="г" or a =="Г":
	b=b+1
else:
	b=b+0

print('\
\n На русском языке говорят 289 миллионов человек по всему миру,\
\n в том числе 146 миллионов в России, и он является 8-м наиболее распространенным языком в мире.\
\n Это официальный язык России, Белоруссии, Казахстана, Кыргызстана\
\n и Таджикистана, а также признанный региональный язык в Грузии, Молдове и Украине')

input('\
\n 3) Вопрос: Какие английские слова имеют русское происхождение? \
\n(Выберете все правильные варианты ответа)\
\n Варианты:\
\n а) Мамонт \
\n б) Царь \
\n в) Кофе \
\n г) Факт \
\n Ответ: ')
if a =="аб" or a =="ба":
	b=b+1
else:
	b=b+0

print('\
\n Немного английских слов русского происхождения.\
\n Интересные примеры: большевик, космонавт, мамонт, погром,\
\n самовар, спутник, тайга, царь, ушанка и во.ка')

input('\
\n 4) Вопрос: Сколько букв Ф было в сказке А. С. Пушкина (Сказке о царе Салтане)?\
\n Варианты:\
\n а) 45 \
\n б) 23 \
\n в) 1 \
\n г) 7 \
\n Ответ: ')
if a =="а" or a =="a" or a =="А" or a =="A":
	b=b+1
else:
	b=b+0

print('\
\n Большинство слов с буквой Ф в русском языке — заимствованные.\
\n Пушкин гордился тем, что в «Сказке о царе Салтане» \
\n было всего лишь одно слово с этой буквой — флот')

input('\
\n 5) Вопрос: Сколько слов есть в русском языке которые начинаются на Й?\
\n Варианты:\
\n а) 3 \
\n б) 194 \
\n в) 56 \
\n г) 74 \
\n Ответ: ')
if a =="г" or a =="Г":
	b=b+1
else:
	b=b+0

print('\
\n В русском языке есть всего 74 слова, начинающихся с буквы Й.\
\n Но большинство из нас помнит лишь йод, йога и Йошкар-Олу')

input('\
\n 6) Вопрос: Какие слова начинаются на Ы\
\n(Выберете все правильные варианты ответа)\
\n Варианты:\
\n а) Реки \
\n б) Города \
\n в) Животные \
\n г) Имена \
\n Ответ: ')
if a =="аб" or a =="бa":
	b=b+1
else:
	b=b+0

print('\
\n \
\n В русском языке есть слова на Ы. Это названия российских городов и рек:\
\n Ыгыатта, Ыллымах, Ынахсыт, Ыныкчанский, Ытык-кюёль')

input('\
\n 7) Вопрос: Есть-ли слова на которые оканчиватся на три буквы Е?\
\n Варианты:\
\n а) Да \
\n б) Нет \
\n Ответ: ')
if a =="а" or a =="a" or a =="А" or a =="A":
	b=b+1
else:
	b=b+0

print('\
\n Единственные слова в русском языке с тремя буквами Е подряд \
\n — это длинношеее (и прочие на —шеее: например, криво-, коротко-)')

input('\
\n 8) Вопрос: Есть-ли слова в русском языке с приставкой ко-?\
\n Варианты:\
\n а) Да \
\n б) Нет \
\n Ответ: ')
if a =="а" or a =="a" or a =="А" or a =="A":
	b=b+1
else:
	b=b+0

print('\
\n В русском языке есть слово с уникальной для языка приставкой\
\n ко- — закоулок')

input('\
\n 9) Вопрос: Есть-ли слово которое не имеет корня?\
\n Варианты:\
\n а) Да нет наверное \
\n б) Нет \
\n Ответ: ')
if a =="а" or a =="a" or a =="А" or a =="A":
	b=b+1
else:
	b=b+0

print('\
\n Единственное слово русского языка, которое не имеет корня, — вынуть.\
\n Считается, что в этом слове так называемый нулевой корень,\
\n находящийся в чередовании с корнем -им- (вын-им-ать).\
\n Раньше, примерно до XVII века, этот глагол выглядел как вынять,\
\n и в нем был материальный корень, такой же как в снять, обнять, понять (ср. снимать, обнимать, понимать),\
\n однако впоследствии корень -ня- был переосмыслен как суффикс -ну- (как в сунуть, дунуть')

input('\
\n 10) Вопрос: Есть-ли слова с приставкой Я и М?\
\n Варианты:\
\n а) Да \
\n б) Нет \
\n Ответ: ')
if a =="б" or a =="Б":
	b=b+1
else:
	b=b+0

print('\
\n Но в русском языке есть слова с уникальными для языка приставками\
\n и- (итог, итого) и а- (авось; устар. «а вось не повезет»),\
\n образовавшимися от союзов и и а')

input('\
\n 11) Вопрос: Слова бык и пчела — однокоренныe?\
\n Варианты:\
\n а) Да \
\n б) Нет \
\n Ответ: ')
if a =="а" or a =="a" or a =="А" or a =="A":
	b=b+1
else:
	b=b+0

print('\
\n Слова бык и пчела — однокоренные.\
\n В произведениях древнерусской литературы слово пчела писалось как бъчела.\
\n Чередование гласных ъ / ы объясняется происхождением обоих звуков из одного индоевропейского звука u.\
\n Если вспомнить диалектный глагол бучать, имеющий значения «реветь»,\
\n «гудеть», «жужжать» и этимологически родственный словам пчела, букашка и бык,\
\n то становится ясным, каково же было общее значение этих слов')

input('\
\n 12) Вопрос: Предлагал-ли Владимир Иванович Даль заменить слово атмосфера?\
\n на русские слова колоземица или мироколится?\
\n Варианты:\
\n а) Да \
\n б) Нет \
\n Ответ: ')
if a =="а" or a =="a" or a =="А" or a =="A":
	b=b+1
else:
	b=b+0

print('\
\n Владимир Иванович Даль предлагал заменить иностранное слово атмосфера\
\n на русские колоземица или мироколица')

input('\
\n 13) Вопрос: Назывались ли на Руси непреличные слова в XIV веке *нелепыми глаголами*?\
\n Варианты:\
\n а) Да \
\n б) Нет \
\n Ответ: ')
if a =="а" or a =="a" or a =="А" or a =="A":
	b=b+1
else:
	b=b+0

print('\
\n До XIV века на Руси все неприличные слова назывались «нелепыми глаголами».\
\n')

input('\
\n 14) Вопрос: Есть-ли эти слова в русском языке:\
\n рентгеноэлектрокардиографического и превысокомногорассмотрительствующий?\
\n Варианты:\
\n а) Да \
\n б) Нет \
\n Ответ: ')
if a =="а" or a =="a" or a =="А" or a =="A":
	b=b+1
else:
	b=b+0

print('\
\n В Книге рекордов Гиннесса 1993 года самым длинным словом русского языка названо\
\n рентгеноэлектрокардиографического, \
\n в издании 2003 года — превысокомногорассмотрительствующий\
\n')

input('\
\n 15) Вопрос: Состоит-ли русский язык в списке самых богатых литературных языков?\
\n Варианты:\
\n а) Да \
\n б) Нет \
\n Ответ: ')
if a =="а" or a =="a" or a =="А" or a =="A":
	b=b+1
else:
	b=b+0

print('\
\n Русский язык находится в списке самых богатых литературных языков.\
\n Это неудивительно, русская литература невероятна, и на самом деле многие люди изучают русский язык для литературы.\
\n Русский язык определенно привлекает толпу умных людей именно по этой причине.\
\n Любопытно?\
\n Если да, то можете перейти по этой ссылке. Кстати вот с этого сайта я и списывал)\
\n Русский\
\n Источник: https://vseznaesh.ru/28-interesnyh-faktov-o-russkom-yazyke © ВсеЗнаешь.ру\
\n')

input('\
\n 16) Вопрос: Человек при жизни получает это трижды:\
\n два раза абсолютно бесплатно, на третий раз ему приходится за это платить.\
\n Догадайтесь, о чем идет речь?\
\n Напишите ответ:\
\n Ответ: ')
if a =="О зубах" or a =="о зубах":
	b=b+1
else:
	b=b+0

print('\
\n О зубах))\
\n')

input('\
\n 17) Вопрос: В каком случае, смотря на цифру 2,\
\n человек произносит «десять»?\
\n Напишите ответ:\
\n Ответ: ')
if a =="Когда на электронных часах 22:00" or a =="когда на электронных часах 22:00":
	b=b+1
else:
	b=b+0


print('\
\n Когда на электронных часах 22:00)))\
\n')

input('\
\n 18) Вопрос: Дороги имеются — ехать нельзя,\
\n Земля есть — пахать нельзя,\
\n Луга есть — косить нельзя,\
\n В реках, морях воды нет.\
\n Напишите ответ:\
\n Ответ: ')
if a =="Географическая карта" or a =="географическая карта":
	b=b+1
else:
	b=b+0

print('\
\n Географическая карта)\
\n')

input('\
\n 19) Вопрос: Какое колесо не крутится при правом развороте?\
\n Напишите ответ:\
\n Ответ: ')
if a =="Запасное" or a =="запасное":
	b=b+1
else:
	b=b+0

print('\
\n Запасное)\
\n')

input('\
\n 20) Вопрос: Все меня топчут, а я — всё лучше.\
\n Напишите ответ:\
\n Ответ: ')
if a =="Тропинка" or a =="тропинка":
	b=b+1
else:
	b=b+0

print('\
\n Тропинка)\
\n')
print('Ваши баллы: '+ str(b) +' из 20 баллов!')

input('Нажмите Enter для завершения программы')